# Chapter 5

In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series, DataFrame

What is Series?
    1. A Series is a one-dimensional array-like object containing a sequence of values (of
    similar types to NumPy types) and an associated array of data labels, called its index.
Whta is DataFrame?
    2. A DataFrame represents a rectangular table of data and contains an ordered collection
    of columns, each of which can be a different value type (numeric, string,
    boolean, etc.). The DataFrame has both a row and column index; it can be thought of
    as a dict of Series all sharing the same index.

# Series

In [13]:
d = pd.Series(7)
d
#type(d)

0    7
dtype: int64

In [12]:
o = [1,2,3]
f = pd.Series(o)
f

0    1
1    2
2    3
dtype: int64

In [14]:
obj= pd.Series(np.arange(7.))
obj

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
dtype: float64

In [16]:
obj = pd.Series(np.arange(7))
obj

#arange is similar to range, generates no one less than the given no
#in python genral range is used and in numpy arange is used

0    0
1    1
2    2
3    3
4    4
5    5
6    6
dtype: int32

In [17]:
obj.values

array([0, 1, 2, 3, 4, 5, 6])

In [8]:
obj.index

RangeIndex(start=0, stop=7, step=1)

In [20]:
obj2= pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj2

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [22]:
obj2['a']

0.0

In [23]:
obj2['e']

4.0

In [25]:
obj2[['a','c','e']]

a    0.0
c    2.0
e    4.0
dtype: float64

In [24]:
obj2['a','c','e']

KeyError: ('a', 'c', 'e')

In [26]:
obj2[3]

3.0

In [27]:
obj2[obj2<3]

a    0.0
b    1.0
c    2.0
dtype: float64

In [28]:
obj2 * 2

a    0.0
b    2.0
c    4.0
d    6.0
e    8.0
dtype: float64

In [29]:
np.exp(obj2)          #???

a     1.000000
b     2.718282
c     7.389056
d    20.085537
e    54.598150
dtype: float64

In [22]:
'b' in obj2

True

In [30]:
'c' in obj2

True

In [31]:
'z' in obj2

False

In [37]:
sdata = {'ohio':35000,'texas':71000,'oregon':16000,'utah':5000}

In [38]:
obj3 = pd.Series(sdata)
obj3

ohio      35000
texas     71000
oregon    16000
utah       5000
dtype: int64

In [42]:
states = ['california', 'ohio', 'oregon', 'texas']

In [43]:
obj4 = pd.Series(sdata, index=states)
obj4

california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
dtype: float64

In [44]:
pd.isnull(obj4)

california     True
ohio          False
oregon        False
texas         False
dtype: bool

In [45]:
pd.notnull(obj4)

california    False
ohio           True
oregon         True
texas          True
dtype: bool

In [46]:
obj4.name= 'population'

In [47]:
obj4.index.name= 'states'

In [48]:
obj4

states
california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
Name: population, dtype: float64

In [49]:
obj4['california'] = 483844

In [50]:
obj4

states
california    483844.0
ohio           35000.0
oregon         16000.0
texas          71000.0
Name: population, dtype: float64

# DataFrame

In [51]:
data = {
    'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year':[2000, 2001, 2002, 2001, 2002, 2003],
    'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]  
        }

In [53]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [54]:
pd.DataFrame(data,columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [58]:
frame2 = pd.DataFrame(data,columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [59]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [60]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [63]:
frame2.pop

<bound method NDFrame.pop of        year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN>

In [62]:
frame2.debt

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [64]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [65]:
frame2.loc['two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [68]:
frame2.loc[['two','three']]

       year state  pop debt
two    2001  Ohio  1.7  NaN
three  2002  Ohio  3.6  NaN

In [70]:
frame2.loc['two':'four']

       year   state  pop debt
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN

In [ ]:
frame2.iloc[]

In [71]:
frame2.loc['one']                    #in loc index name goes, always a string

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [75]:
frame2['debt']= np.random.randn(6)

In [87]:
frame2['paymnt'] = np.random.randn(6)

In [88]:
frame2

       year   state  pop  debt    paymnt
one    2000    Ohio  1.5   NaN -1.215479
two    2001    Ohio  1.7  -1.2 -0.679615
three  2002    Ohio  3.6  -1.7  0.092625
four   2001  Nevada  2.4  -1.5  1.300849
five   2002  Nevada  2.9   NaN  2.234724
six    2003  Nevada  3.2  -8.9 -0.414261

In [89]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [90]:
val = pd.Series([-1.2, -1.5, -1.7,-8.9],index=['two','four','three','six'])

In [91]:
frame2['debt']=val

In [92]:
frame2

       year   state  pop  debt    paymnt
one    2000    Ohio  1.5   NaN -1.215479
two    2001    Ohio  1.7  -1.2 -0.679615
three  2002    Ohio  3.6  -1.7  0.092625
four   2001  Nevada  2.4  -1.5  1.300849
five   2002  Nevada  2.9   NaN  2.234724
six    2003  Nevada  3.2  -8.9 -0.414261

In [95]:
frame2['bol'] = frame2.debt<0
frame2

       year   state  pop  debt    paymnt  eastern    bol
one    2000    Ohio  1.5   NaN -1.215479     True  False
two    2001    Ohio  1.7  -1.2 -0.679615     True   True
three  2002    Ohio  3.6  -1.7  0.092625     True   True
four   2001  Nevada  2.4  -1.5  1.300849    False   True
five   2002  Nevada  2.9   NaN  2.234724    False  False
six    2003  Nevada  3.2  -8.9 -0.414261    False   True

In [96]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt    paymnt  eastern    bol
one    2000    Ohio  1.5   NaN -1.215479     True  False
two    2001    Ohio  1.7  -1.2 -0.679615     True   True
three  2002    Ohio  3.6  -1.7  0.092625     True   True
four   2001  Nevada  2.4  -1.5  1.300849    False   True
five   2002  Nevada  2.9   NaN  2.234724    False  False
six    2003  Nevada  3.2  -8.9 -0.414261    False   True

In [97]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'paymnt', 'eastern', 'bol'], dtype='object')

In [98]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [101]:
pop = { 'Nevada' : {2001: 2.4, 2002: 2.9} , 'ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [102]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

You can transpose the DataFrame (swap rows and columns) with similar syntax to a
NumPy array:

In [103]:
frame3.T         #column name becomes row names and vice versa

        2001  2002  2000
Nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

In [104]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [106]:
pdata = {'ohio': frame3['ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
pdata

{'ohio': 2001    1.7
 2002    3.6
 Name: ohio, dtype: float64,
 'Nevada': 2001    2.4
 2002    2.9
 Name: Nevada, dtype: float64}

In [109]:
pdata = {'ohio':frame3['ohio'][:-1],'Nevada':frame3['Nevada'][:1]}
pdata

{'ohio': 2001    1.7
 2002    3.6
 Name: ohio, dtype: float64,
 'Nevada': 2001    2.4
 Name: Nevada, dtype: float64}

In [111]:
pd.DataFrame(pdata)

      ohio  Nevada
2001   1.7     2.4
2002   3.6     NaN

In [113]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [120]:
frame3.index.name = 'B' 
frame3.columns.name = 'A'

In [121]:
frame3

A     Nevada  ohio
B
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [122]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [123]:
frame2.values

array([[2000, 'Ohio', 1.5, nan, -1.2154792606559666, True, False],
       [2001, 'Ohio', 1.7, -1.2, -0.6796145982893801, True, True],
       [2002, 'Ohio', 3.6, -1.7, 0.09262455125326001, True, True],
       [2001, 'Nevada', 2.4, -1.5, 1.3008491748741164, False, True],
       [2002, 'Nevada', 2.9, nan, 2.2347238994897367, False, False],
       [2003, 'Nevada', 3.2, -8.9, -0.41426050704646833, False, True]],
      dtype=object)

In [124]:
labels = pd.Index(np.arange(3))

In [125]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [81]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [82]:
'Ohio' in frame3.columns

True

In [83]:
2003 in frame3.index

False

1. append: Concatenate with additional Index objects, producing a new Index
2. difference: Compute set difference as an Index
3. intersection: Compute set intersection
4. union: Compute set union
5. isin: Compute boolean array indicating whether each value is contained in the passed collection
6. delete: Compute new Index with element at index i deleted
7. drop: Compute new Index by deleting passed values
8. insert: Compute new Index by inserting element at index i
9. is_monotonic: Returns True if each element is greater than or equal to the previous element
10. is_unique: Returns True if the Index has no duplicate values
11. unique: Compute the array of unique values in the Index

# Reindexing

An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index. Consider an example:

In [126]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [127]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [128]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [130]:
obj2.loc['a']

-5.3

In [131]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [132]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [134]:
obj3.reindex(range(6),method='ffill')
obj3            #means reindexing is an inline operation

0      blue
2    purple
4    yellow
dtype: object

In [135]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [138]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','b','c'],columns=['Ohio', 'Texas', 'California'])

In [139]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [140]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [141]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [142]:
states = ['Texas', 'Utah', 'California']

In [143]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [144]:
frame.columns

Index(['Ohio', 'Texas', 'California'], dtype='object')

In [150]:
frame.drop('Texas')

KeyError: "['Texas'] not found in axis"

In [101]:
frame.loc[['a', 'b', 'c', 'd'], states]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

1. index New sequence to use as index. Can be Index instance or any other sequence-like Python data structure. An
2. Index will be used exactly as is without any copying.
3. method Interpolation (fill) method; 'ffill' fills forward, while 'bfill' fills backward.
4. fill_value Substitute value to use when introducing missing data by reindexing.
5. limit When forward- or backfilling, maximum size gap (in number of elements) to fill.
6. tolerance When forward- or backfilling, maximum size gap (in absolute numeric distance) to fill for inexact matches.
7. level Match simple Index on level of MultiIndex; otherwise select subset of.
8. copy If True, always copy underlying data even if new index is equivalent to old index; if False, do not copy
9. the data when the indexes are equivalent.

In [145]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [146]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [147]:
new_obj = obj.drop('c')

In [105]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [151]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [153]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [154]:
data.drop(['Colorado'])

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [155]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [156]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [158]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [111]:
obj.drop('c', inplace=True)      #will not return a new object

In [112]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [114]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [115]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [116]:
obj['b']

1.0

In [159]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [160]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [161]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [162]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [163]:
obj['b':'c'] = 5

In [164]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
e    4.0
dtype: float64

In [165]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], \
                    columns=['one', 'two', 'three', 'four'])

In [166]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [167]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [168]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [169]:
data[data < 5] = 0

In [170]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [129]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [172]:
data.loc['Ohio',['two','three']]

two      0
three    0
Name: Ohio, dtype: int32

In [173]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [174]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [132]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [175]:
data.iloc[[1,3],[3,2]]

          four  three
Colorado     7      6
New York    15     14

In [176]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [177]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [179]:
data.iloc[:,:2][data.two>5]

          one  two
Utah        8    9
New York   12   13

# Arithmetic and Data Alignment

In [180]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [181]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [182]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [183]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [184]:
s1 + s2                     #like outer join in databases

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [189]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [190]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [191]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [192]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [144]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [193]:
df1 - df2

            b   c    d   e
Colorado  NaN NaN  NaN NaN
Ohio     -3.0 NaN -2.0 NaN
Oregon    NaN NaN  NaN NaN
Texas    -3.0 NaN -2.0 NaN
Utah      NaN NaN  NaN NaN

In [194]:
df2.loc[1, 'b'] = np.nan

In [195]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [196]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [197]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [198]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [200]:
df2.loc[1, 'b'] = np.nan

In [201]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [202]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [203]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [204]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

1. add, radd Methods for addition (+)
2. sub, rsub Methods for subtraction (-)
3. div, rdiv Methods for division (/)
4. floordiv, rfloordiv Methods for floor division (//)
5. mul, rmul Methods for multiplication (*)
6. pow, rpow Methods for exponentiation (**)

In [209]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [210]:
frame

               b         d         e
Utah    1.075864 -1.712510  0.329479
Ohio    0.745494  0.292344 -0.551644
Texas   0.570056 -0.662727  0.449230
Oregon  0.121144 -0.379773 -0.344036

In [211]:
f = lambda x: x.max() - x.min()

In [207]:
frame.apply(f)

ValueError: no results

In [212]:
frame.apply(f, axis='columns')

Utah      2.788374
Ohio      1.297138
Texas     1.232783
Oregon    0.500917
dtype: float64

In [213]:
format = lambda x: '%.2f' % x                  #???

In [163]:
frame.applymap(format)                  #???

           b      d      e
Utah    0.02   1.75   1.25
Ohio    0.47  -0.63  -0.08
Texas   0.47   1.29   0.03
Oregon  1.71  -1.29   0.48

In [214]:
frame['e'].map(format)                                   #???

Utah       0.33
Ohio      -0.55
Texas      0.45
Oregon    -0.34
Name: e, dtype: object

In [215]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [216]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [217]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [218]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [219]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [220]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [221]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [222]:
obj = pd.Series([4, 7, -3, 2])

In [223]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [224]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [225]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [226]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [227]:
obj.sort_values

<bound method Series.sort_values of 0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64>

In [229]:
frame.sort_values(by=['a', 'b'])             #??

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [230]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [231]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [232]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [233]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [234]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [185]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], \
                  index=['a', 'b', 'c', 'd'], columns=['one', 'two'])

In [186]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [187]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [188]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [189]:
df.mean(axis='columns', skipna=False) #skip nan values

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [190]:
df.idxmax()

one    b
two    d
dtype: object

In [191]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [192]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [193]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [194]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [195]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [196]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

ModuleNotFoundError: No module named 'pandas_datareader'

In [197]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [199]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [200]:
uniques = obj.unique()

In [201]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [202]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [203]:
pd.value_counts(obj.values, sort=False)

a    3
b    2
c    3
d    1
dtype: int64

In [204]:
mask = obj.isin(['b', 'c'])

In [205]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [206]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [207]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4], 'Qu2': [2, 3, 1, 2, 3], 'Qu3': [1, 5, 2, 4, 4]})

In [208]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [209]:
result = data.apply(pd.value_counts).fillna(0)

In [210]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0